# დავალება 1


nums = [2,4,1,5,6,9,10]

biggest = nums[0]

second_biggest = 0

for i in nums:
    if i > biggest:
        second_biggest = biggest
        biggest = i
print(second_biggest)


# 2) მომხმარებელს შემოატანინეთ წინადადება და დაითვალეთ თუ ამ წინადადებაში რამდენი სიტყვის
#სიგრძე არის 4-ზე მეტი, დაპრინტეთ ასეთი სიტყვების რაოდენობა, მაგალითად 4. გამოიყენეთ while ციკლი.


sentence = input("choose any sentece")

count = 0
l = 0
i = 0

while i < len(sentence):
    if sentence[i] != " ":
        l += 1
    elif sentence[i] ==  " "  and l > 4:
        count += 1
        l = 0
    i += 1
print(count)

# 3) მომხმარებელს შემოატანინეთ სიტყვა და გაიგეთ ეს სიტყვა არის თუ არა პალინდრომი - ანუ ეს სიტყვა წინიდანაც და უკნიდანაც თუ ზუსტად
#  იგივენაირად იკითხება. თუ კი მაშინ დაპრინტეთ True,  თუ არა დაპრინტეთ False, გამოიყენეთ for ციკლი, არ გამოიყენოთ slicing - [::-1].

# ვერ გავიგე




#4) შექმენით არეული რიცხვებით სავსე გრძელი სია და 2 ცარიელი სია, ერთ სიაში ჩააგდეთ ყველა ის რიცხვი რომელიც არის ლუწი და 
# დგას კენტ ინდექსზე, ხოლო მეორე სიაში ჩააგდეთ ყველა ის რიცხვირომელიც არის ლუწი და დგას კენტ ინდექსზე, გამოიყენეთ for ციკლი.

nums = [2,4,1,5,6,9,10]

empty = []

empty2 = []

for i in nums:
    if i % 2 == 0 and nums.index(i) % 2 == 1:
        empty.append(i)
    elif i % 2 == 1 and nums.index(i) % 2 == 0:
        empty2.append(i)

print("რიცხვები რომელიც დგას კენტს ინდექსზე და არის ლუწი", empty)

print("რიცხვები რომელიც დგას ლუწ ინდექსზე და არის კენტი", empty2)



# 5) შექმენით ყველანაირი მონაცემთა ტიპების ელემენტებით სავსე სია, ამოშალეთ ყველა დუპლიკატები 
# - ყველაფერი რაც მეორდება 2-ზე მეტჯერ, გამოიყენეთ remove() ფუნქცია და while ციკლი.

# numbers = [2,True,"gega","rezi",2,True,4.2,10,6.7,False,"gega"]

# new_numbers = []

# for i in numbers:
#     if i not in new_numbers:
#         new_numbers.append(i)
# print(new_numbers)

# 6)  მომხმარებელს შემოატანინეთ წინადადება და დაპრინტეთ ამ წინადადებაში მყოფი 
# ყველაზე გრძელი სიტყვა, გამოიყენეთ while ციკლი, არ გამოიყენოთ max() ფუნქცია.
