# დავალება 1

# ჩვენ ვისწავლეთ შემდეგი მათემატიკური ოპერატორები ----> **, // , %

# ** ეს ოპერატორი აკეთებს შემდეგ მოქმედებას

print(2**3)# აქ გამოვა 8 რადგან მან 2 აიღო ხარისხარ 3მში

print(3**2)

print(4**2)


# // ეს ოპერატორი წერს თუ რამდეეჯერ ჩაეტევა მითითბული რიცხვი მეორე რიცხვში მაგ:


print(10//2)


print(20//10)


print(40//20)


# % ეს ოპერატორი წერს თუ რამდენი არის ნაშთი


print(20 % 5)

print(50 % 5)

print(200 % 20)



# დავალება 2

# სიები და ცვლადები ერთმანეთისგან განსხვავდება იმითინ რომ ცვლადებში მხოლოდ 1 მონაცემის შენახვა შეგიძლია სიაში ბევრის





# დავალება 3



chemi_sia = ["gega",80,80.20,True]


print (chemi_sia)